"use client";

export default function GetCoupons() {
  return (
    <>
      <section className="get-coupons">
        <div className="container">
          <div className="main">
            <article className="title">
              <h3>優惠卷領取</h3>
            </article>
            <article className="content">
              <div className="coupon-growp">
                <div className="item-coupon">
                  <div className="left">
                    <div className="top">
                      <p>迎接2025！正月10張請收下</p>
                      <div className="title">運費抵用券</div>
                    </div>
                    <p>2025-01-31 23:59&nbsp;結束</p>
                  </div>
                  <div className="right">
                    <p>領取</p>
                  </div>
                </div>
              </div>
              <div className="coupon-txt">
                <h3>運費券領取暨使用規則</h3>
                <ol>
                  <li>
                    本規則所稱運費券(或稱運費抵用券)是指網站所提供予會員抵減、抵扣、減免運費或其他提供運費優惠價格、優惠方案之電子券。
                  </li>
                  <li>
                    會員限於網站下標商品或服務並於填寫結帳單時選用「PChomePay支付連」為付款方式，始能使用運費券進行折抵；當會員領取運費抵用券時即代表會員同意運費券領取暨使用規則(下稱本規則)。
                  </li>
                  <li>
                    每期活動提供不特定數量之運費抵用券予會員，具有領取運費抵用券資格之會員可透過專屬活動頁領取，同一會員可領取運費抵用券張數視當期所提供之張數為準。
                  </li>
                  <li>
                    使用同一手機號碼完成註冊之會員視為同一會員，同一會員僅具有一個運費抵用券領取資格，同一會員使用其所註冊之一個會員帳號領取運費抵用券過後，即不得再使用其他會員帳號領取。
                  </li>
                  <li>
                    會員當期未領取之運費抵用券，則其領取資格於該期結束後自動失效，未領取之張數不得累計至下期。
                  </li>
                  <li>
                    運費抵用券有使用期限，會員應依之指示於使用期限內使用完畢，逾期自動失效，並不得再主張任何權利。
                  </li>
                  <li>
                    運費抵用券之使用名額有限，用完為止。已領取運費抵用券之會員不代表一定能使用運費抵用券抵減運費金額或獲得運費優惠價格，仍須以會員使用運費抵用券之該筆交易結帳時成功使用為準。
                  </li>
                  <li>
                    運費抵用券僅得於所指定或標示之賣場及商品使用，實際可以使用運費抵用券之賣場及商品，以當期所指定或標示之為準。
                  </li>
                  <li>
                    運費抵用券所適用之超商類型、折抵門檻、折抵運費金額或獲得之運費優惠價格等使用限制及條件，依會員使用運費抵用券之該筆交易訂單結帳時系統所顯示之限制及條件為準。
                  </li>
                  <li>
                    會員每日可以使用之運費抵用券張數不限，將依據會員所領取之有效運費抵用券數量用完為止。
                  </li>
                  <li>同一筆訂單交易，會員僅得使用一張運費抵用券。</li>
                  <li>
                    使用運費抵用券之該筆交易若有取消交易或是交易未完成的情況，將返還與該運費抵用券成功使用時相同效期(使用期限)之運費抵用券予會員並恢復至未使用之狀態，會員得否於下一筆交易結帳時成功使用運費抵用券，仍需以當時之實際使用限制及條件為準。
                  </li>
                  <li>
                    未領取、超過使用期限、使用名額已滿或是其他無法成功使用之運費抵用券將自動失效，會員不得再主張權利。
                  </li>
                  <li>運費抵用券不得轉讓、兌換現金或其他利益。</li>
                  <li>本規則以中華民國法令為準據法。</li>
                  <li>
                    關於會員間因本規則或因使用運費抵用券所生之爭議，如因此而涉訟，除法令另有強制或禁止之規定者應依其規定者外，以台灣台北地方法院為第一審管轄法院。
                  </li>
                  <li>
                    保留隨時修改、變更或終止本規則、運費抵用券活動內容或是相關事宜之權利。修改後之運費抵用券規則、內容或是相關事宜，露天拍賣得於網站公告，不另行個別通知。
                  </li>
                  <li>
                    對於本規則、運費抵用券活動內容、注意事項及所有關於運費抵用券之事宜保有最終解釋權。
                  </li>
                </ol>
                {/* <img class="coupon-toggle" src="assets/images/coupon/arrow_up.png"> */}
              </div>
            </article>
          </div>
        </div>
      </section>
    </>
  );
}
